lvx/base/Documents/бит_му_РасчетОтложенныхНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_му_РасчетОтложенныхНалогов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.бит_Дополнительный_4</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоБюджетам</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_3</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_1</xr:Item>
				<xr:Item>AccumulationRegister.бит_СоответствиеОборотовТрансляции</xr:Item>
				<xr:Item>AccumulationRegister.бит_ОборотыПоТипамПроводок</xr:Item>
				<xr:Item>AccountingRegister.бит_Бюджетирование</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_5</xr:Item>
				<xr:Item>AccountingRegister.бит_Дополнительный_2</xr:Item>
				<xr:Item>InformationRegister.бит_СоответствиеЗаписейТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНалогаНаПрибыль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаОНА</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаОНО</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетРасходовДоходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто_4</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСторно</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВЗакрытомПериоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасчетыОН</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАктивовОбязательств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_му_ВидыАктивовОбязательств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНУ</Name>
							<Comment>Налоговая база</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМУ</Name>
							<Comment>Балансовая стоимость</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПР</Name>
							<Comment>Постоянные разницы</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВР</Name>
							<Comment>Временные разницы</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОНА</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОНО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетРасходовДоходов</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто_1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто_2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто_3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто_4</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыСубконтоДополнительные_2</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтредактированоВручную</Name>
							<Comment>Данные строки отредактированы вручную</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНалогаНаПрибыль</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/InformationRegisters/бит_му_РасчетыОтложенныхНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_му_РасчетыОтложенныхНалогов</Name>
			<Comment>(БИТ МУ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаМУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОНА</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОНО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалогаНаПрибыль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтредактированоВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_му_РасчетОтложенныхНалогов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАктивовОбязательств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_му_ВидыАктивовОбязательств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Documents/бит_му_РасчетОтложенныхНалогов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мКоличествоСубконтоМУ; // Хранит количество субконто МУ.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
	     ЗаполнитьШапкуПоСтруктуре(ДанныеЗаполнения);
	КонецЕсли;
	 
	ПервоначальноеЗаполнениеДокумента();
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	

	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки.
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка, Отказ, Заголовок, ЭтотОбъект, Ложь) Тогда
		Возврат
	КонецЕсли;
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	СтруктураТаблиц 		= ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента);	
	
	ПроверкаДанных(СтруктураШапкиДокумента, СтруктураТаблиц, Отказ, Заголовок);
	
	// Получим курсы валют, неоходимые для выполнения пересчетов.
	ВидыКурсов = Новый Структура("Упр, Регл, МУ, Документ");
	СтруктураКурсыВалют = бит_му_ОбщегоНазначения.КурсыВалютДокументаМУ(ЭтотОбъект, СтруктураШапкиДокумента.Дата, ВидыКурсов);
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, СтруктураТаблиц, СтруктураКурсыВалют, Отказ, Заголовок);
	КонецЕсли;
               
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
	
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		
	
		
КонецПроцедуры // ПриЗаписи()

Процедура ПриКопировании(ОбъектКопирования)
	
	ПервоначальноеЗаполнениеДокумента(ОбъектКопирования);
	
КонецПроцедуры // ПриКопировании()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция готовит таблицы документа для проведения.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
// 
// Возвращаемое значение:
//  Структура.
// 
Функция ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента) Экспорт
	
	// Расчеты ОН.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Табл.ВидАктивовОбязательств,
	|	ЕСТЬNULL(Табл.СуммаОНА, 0) КАК СуммаОНА,
	|	ЕСТЬNULL(Табл.СуммаОНО, 0) КАК СуммаОНО,
	|	ВЫБОР
	|		КОГДА Табл.СчетРасходовДоходов = ЗНАЧЕНИЕ(ПланСчетов.бит_Дополнительный_2.ПустаяСсылка)
	|			ТОГДА Документ.СчетРасходовДоходов
	|		ИНАЧЕ Табл.СчетРасходовДоходов
	|	КОНЕЦ КАК СчетРасходовДоходов,
	|	ВЫБОР
	|		КОГДА Табл.СчетРасходовДоходов = ЗНАЧЕНИЕ(ПланСчетов.бит_Дополнительный_2.ПустаяСсылка)
	|			ТОГДА Документ.Субконто_1
	|		ИНАЧЕ Табл.Субконто_1
	|	КОНЕЦ КАК Субконто_1,
	|	ВЫБОР
	|		КОГДА Табл.СчетРасходовДоходов = ЗНАЧЕНИЕ(ПланСчетов.бит_Дополнительный_2.ПустаяСсылка)
	|			ТОГДА Документ.Субконто_2
	|		ИНАЧЕ Табл.Субконто_2
	|	КОНЕЦ КАК Субконто_2,
	|	ВЫБОР
	|		КОГДА Табл.СчетРасходовДоходов = ЗНАЧЕНИЕ(ПланСчетов.бит_Дополнительный_2.ПустаяСсылка)
	|			ТОГДА Документ.Субконто_3
	|		ИНАЧЕ Табл.Субконто_3
	|	КОНЕЦ КАК Субконто_3,
	|	ВЫБОР
	|		КОГДА Табл.СчетРасходовДоходов = ЗНАЧЕНИЕ(ПланСчетов.бит_Дополнительный_2.ПустаяСсылка)
	|			ТОГДА Документ.Субконто_4
	|		ИНАЧЕ Табл.Субконто_4
	|	КОНЕЦ КАК Субконто_4,
	|	Табл.ОтредактированоВручную
	|ИЗ
	|	Документ.бит_му_РасчетОтложенныхНалогов.РасчетыОН КАК Табл,
	|	Документ.бит_му_РасчетОтложенныхНалогов КАК Документ
	|ГДЕ
	|	Документ.Ссылка = &Ссылка
	|	И Табл.Ссылка = &Ссылка
	|";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаПоРасчетыОН = РезультатЗапроса.Выгрузить();
	
	// Структура таблиц.
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("РасчетыОН"		 , ТаблицаПоРасчетыОН);
	
	Возврат СтруктураТаблиц;
	
КонецФункции // ПодготовитьТаблицыДокумента()

// Процедура обрабатывает изменение валюты документа.
// 
Процедура ИзменениеВалютыМодуль() Экспорт

	СтруктураКурса = бит_КурсыВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	
	КурсДокумента      = СтруктураКурса.Курс;
	КратностьДокумента = СтруктураКурса.Кратность;

КонецПроцедуры // ИзменениеВалютыМодуль()

// Функция формирует структуру данных, 
// куда входит информация по валюте документа и валюта регламентированного учета,
// организация, дата документа.
// 
// Параметры:
//  СтруктураВалют - Структура.
//  
// Возвращаемое значение:
//   Структура 
// 
Функция ДанныеПоВалютам(СтруктураВалют) Экспорт

	СтруктураДанных = Новый Структура;
	
	СтруктураДанных.Вставить("Валюта"   		, ВалютаДокумента);
	СтруктураДанных.Вставить("Курс"     		, КурсДокумента);
	СтруктураДанных.Вставить("Кратность"		, КратностьДокумента);
	
	СтруктураДанных.Вставить("ВалютаМСФО"   , СтруктураВалют.ВалютаМСФО);
	СтруктураДанных.Вставить("КурсМСФО"     , СтруктураВалют.КурсМСФО);
	СтруктураДанных.Вставить("КратностьМСФО", СтруктураВалют.КратностьМСФО);
	
	СтруктураДанных.Вставить("ВалютаРеглУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	
    СтруктураДанных.Вставить("Дата"		  			, Дата);
	СтруктураДанных.Вставить("Организация"			, Организация);
	СтруктураДанных.Вставить("СтавкаНалогаНаПрибыль", СтавкаНалогаНаПрибыль);
	СтруктураДанных.Вставить("ВидыАктивовОбязательств", Новый Массив);
	
	Возврат СтруктураДанных;
	
КонецФункции

// Процедура удаляет запись протокола для текущего вида активов/обяхательств.
//
// Параметры:
//  ВидАктивовОбязательств - СправочникСсылка.бит_му_ВидыАктивовОбязательств.
//  РасшифровкаРасчетов    - ТаблицаЗначений.
//
Процедура УдалитьДанныеПоВидуАктивовОбязательств(ВидАктивовОбязательств, РасшифровкаРасчетов) Экспорт

	НайденныеСтроки = РасшифровкаРасчетов.НайтиСтроки(Новый Структура("ВидАктивовОбязательств", ВидАктивовОбязательств));
	Для каждого Стр Из НайденныеСтроки Цикл	
		РасшифровкаРасчетов.Удалить(Стр);	
	КонецЦикла; 
	
КонецПроцедуры // УдалитьЗаписьПротокола()

// Функция получает данные для расчетов отложенных налогов.
// 
// Параметры:
//  СтруктураДанных     - Структура.
//  РасшифровкаРасчетов - ТаблицаЗначений.
//  
// Возвращаемое значение:
//  Массив.
// 
Функция ПолучитьДанныеДляРасчетовОН(СтруктураДанных, РасшифровкаРасчетов) Экспорт
	
	// Массив результата.
	МассивРезультата = Новый Массив;
	
	// Описание типов для вспомогательной таблицы:
	Тип_Число_15_2  = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	Тип_Организация = Новый ОписаниеТипов("СправочникСсылка.Организации");
	Тип_СубконтоХоз = Метаданные.ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Тип;
		
	// Вспомогательная таблица.
	ТаблицаРасшифровки = Новый ТаблицаЗначений;
	ТаблицаРасшифровки.Колонки.Добавить("Организация", Тип_Организация);
	ТаблицаРасшифровки.Колонки.Добавить("СуммаМУ"	 , Тип_Число_15_2);
	ТаблицаРасшифровки.Колонки.Добавить("СуммаНУ"	 , Тип_Число_15_2);
	ТаблицаРасшифровки.Колонки.Добавить("СуммаПР"	 , Тип_Число_15_2);
	ТаблицаРасшифровки.Колонки.Добавить("СуммаВР"	 , Тип_Число_15_2);
	ТаблицаРасшифровки.Колонки.Добавить("СуммаОНА"   , Тип_Число_15_2);
	ТаблицаРасшифровки.Колонки.Добавить("СуммаОНО"   , Тип_Число_15_2);
	ТаблицаРасшифровки.Колонки.Добавить("Субконто1"  , Тип_СубконтоХоз); 
	ТаблицаРасшифровки.Колонки.Добавить("Субконто2"  , Тип_СубконтоХоз); 
	ТаблицаРасшифровки.Колонки.Добавить("Субконто3"  , Тип_СубконтоХоз); 
	
	// Ставка налога на прибыль.
	ТекСтавкаНалогаНаПрибыль = СтруктураДанных.СтавкаНалогаНаПрибыль;
	 	
	// Формируем ТаблицаДанных для заполнения табличной части РасчетыОН.
	РезультатЗапроса = бит_му_ОбщегоНазначения.ПолучитьНастройкиРасчетаОтложенныхНалогов(СтруктураДанных);
	
	ВыборкаВидАО = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаВидАО.Следующий() Цикл
		
		ВидАктивовОбязательств = ВыборкаВидАО.ВидАктивовОбязательств;
		НомерСтроки = 1;
		
		УдалитьДанныеПоВидуАктивовОбязательств(ВидАктивовОбязательств, РасшифровкаРасчетов);
		
		СуммаНУ  = 0;
		СуммаМУ  = 0;
		СуммаПР  = 0;
		СуммаВР  = 0;
		СуммаОНА = 0;
		СуммаОНО = 0;  
			
		// Выборка по источникам.
		ВыборкаИсточники = ВыборкаВидАО.Выбрать();
     	Пока ВыборкаИсточники.Следующий() Цикл
			
			ТаблицаРасшифровки.Очистить();
			Источник = ВыборкаИсточники.ИсточникДанных;
	
			ЗаполнитьТаблицуРасшифровки(ТаблицаРасшифровки, СтруктураДанных, Источник);
			
			Для каждого СтрРасш Из ТаблицаРасшифровки Цикл
				
				СтрРасшифровки = РасшифровкаРасчетов.Добавить();
				СтрРасшифровки.ВидАктивовОбязательств = ВидАктивовОбязательств;
				СтрРасшифровки.ИсточникДанных 		  = Источник;
				СтрРасшифровки.ИД 					  = Новый УникальныйИдентификатор;
				СтрРасшифровки.НомерСтроки 		      = НомерСтроки;
				СтрРасшифровки.СтавкаНалогаНаПрибыль  = ТекСтавкаНалогаНаПрибыль;
				
				ЗаполнитьЗначенияСвойств(СтрРасшифровки, СтрРасш);
				
				НомерСтроки = НомерСтроки + 1;
				
			КонецЦикла;
			
			СуммаНУ   = СуммаНУ   + ТаблицаРасшифровки.Итог("СуммаНУ");
			СуммаМУ   = СуммаМУ   + ТаблицаРасшифровки.Итог("СуммаМУ");
			СуммаПР   = СуммаПР   + ТаблицаРасшифровки.Итог("СуммаПР");
			СуммаВР   = СуммаВР   + ТаблицаРасшифровки.Итог("СуммаВР");
			СуммаОНА  = СуммаОНА  + ТаблицаРасшифровки.Итог("СуммаОНА");
			СуммаОНО  = СуммаОНО  + ТаблицаРасшифровки.Итог("СуммаОНО");
			
		КонецЦикла;
				
		// Записываем в массив результата.
		СтрокаРезультата = Новый Структура("ВидАктивовОбязательств, ИсточникДанных, 
										|СуммаНУ, СуммаМУ, СуммаПР, СуммаВР, СуммаОНА, СуммаОНО,
										|ОтредактированоВручную");
        СтрокаРезультата.Вставить("ВидАктивовОбязательств", ВыборкаВидАО.ВидАктивовОбязательств);
		СтрокаРезультата.Вставить("СуммаНУ" , СуммаНУ);
		СтрокаРезультата.Вставить("СуммаМУ" , СуммаМУ);
		СтрокаРезультата.Вставить("СуммаПР" , СуммаПР);
		СтрокаРезультата.Вставить("СуммаВР" , СуммаВР);
		СтрокаРезультата.Вставить("СуммаОНА", СуммаОНА);
		СтрокаРезультата.Вставить("СуммаОНО", СуммаОНО);
		МассивРезультата.Добавить(СтрокаРезультата);
		
		ТаблицаРасшифровки.Очистить();
		
	КонецЦикла;
	
	Возврат МассивРезультата;
	
КонецФункции // ПолучитьДанныеДляРасчетовОН()

// Процедура заполняет табличную часть "РасчетыОН".
// 
// Параметры:
//  СтруктураДанных     - Структура.
//  РасшифровкаРасчетов - ТаблицаЗначений.
// 
Процедура ЗаполнитьТчРасчетыОН(СтруктураДанных, РасшифровкаРасчетов) Экспорт
	
	ДанныеДляРасчетовОН = ПолучитьДанныеДляРасчетовОН(СтруктураДанных, РасшифровкаРасчетов);	
	Для каждого СтрокаДанных Из ДанныеДляРасчетовОН Цикл
		
		НоваяСтрокаТаб = РасчетыОН.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТаб, СтрокаДанных);
		НоваяСтрокаТаб.СтавкаНалогаНаПрибыль = СтруктураДанных.СтавкаНалогаНаПрибыль;
				
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТчРасчетыОН()

// Процедура - записывает расшифровку расчетов в регистр бит_му_РасчетыОтложенныхНалогов.
//
// Параметры:
//  РасшифровкаРасчетов - ТаблицаЗначений.
//
Процедура ЗаписатьРасшифровкуРасчетов(РасшифровкаРасчетов) Экспорт
	
	НаборЗаписей = РегистрыСведений.бит_му_РасчетыОтложенныхНалогов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для каждого Стр Из РасшифровкаРасчетов Цикл
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Стр);
		Запись.Документ = Ссылка;
	КонецЦикла;
	
	НаборЗаписей.Записать();
		
КонецПроцедуры // ЗаписатьРасшифровкуРасчетов()

// Процедура заполняет документ.
// 
// Параметры:
//  СтруктураЗаполнения - Структура.
//
// Возвращаемое значение: 
//  ТаблицаЗначений - таблица для записи в регистр сведений бит_му_РасчетыОтложенныхНалогов.
//
Функция ЗаполнитьДокумент(СтруктураЗаполнения) Экспорт

	Если ТипЗнч(СтруктураЗаполнения) = Тип("Структура") Тогда
	     ЗаполнитьШапкуПоСтруктуре(СтруктураЗаполнения);
	КонецЕсли;
	
	ПервоначальноеЗаполнениеДокумента(Неопределено);
		
	РасшифровкаРасчетов = Новый ТаблицаЗначений;
	Набор               = РегистрыСведений.бит_му_РасчетыОтложенныхНалогов.СоздатьНаборЗаписей();
	РасшифровкаРасчетов = Набор.ВыгрузитьКолонки();	
	РасшифровкаРасчетов.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
		
	СтруктураВалют = Новый Структура("ВалютаМСФО, КурсМСФО, КратностьМСФО"
									, ВалютаДокумента, КурсДокумента, КратностьДокумента);
	СтруктураДанных = ДанныеПоВалютам(СтруктураВалют);
	
	// Заполняет табличную часть "РасчетыОН".
	ЗаполнитьТчРасчетыОН(СтруктураДанных, РасшифровкаРасчетов);	

	Возврат РасшифровкаРасчетов;
	
КонецФункции // ЗаполнитьДокумент()
  
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет таблицу расшифровки.
// 
// Параметры:
//  ТаблицаРасшифровки - Таблица значений.
//  СтруктураДанных    - Структура.
// 
Процедура ЗаполнитьТаблицуРасшифровки(ТаблицаРасшифровки, СтруктураДанных, Источник)
	
	ТаблицаОтбора = ДанныеДляОтбора();
	
	ГраницаНач = НачалоДня(ДобавитьМесяц(Дата, -12));// НачалоМесяца(Дата);
    ГраницаКон = Новый Граница(КонецДня(Дата), ВидГраницы.Включая);
	
	СтрПар = бит_МеханизмПолученияДанных.НовыеПараметрыПолучитьДанныеПоИсточнику();
	СтрПар.ОтборВОтчете = ТаблицаОтбора;
	
 	ТаблицаПоИсточнику = бит_МеханизмПолученияДанных.ПолучитьДанныеПоИсточнику(Источник, ГраницаНач, ГраницаКон, СтрПар);
																	
	Для каждого СтрПоИсточнику Из ТаблицаПоИсточнику Цикл	
		
		СтрРасшифровки = ТаблицаРасшифровки.Добавить();												
		ЗаполнитьЗначенияСвойств(СтрРасшифровки, СтрПоИсточнику);
		
		///////////////////////////////////////////////////////////////////////////
		// Валютные пересчеты 
		// СуммаМУ: из валюты МСФО в валюту документа.			
		СтрРасшифровки.СуммаМУ = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрРасшифровки.СуммаМУ
														 ,СтруктураДанных.ВалютаМСФО
														 ,ВалютаДокумента
														 ,СтруктураДанных.КурсМСФО
														 ,КурсДокумента
														 ,СтруктураДанных.КратностьМСФО
														 ,КратностьДокумента);
		// Остальные суммы: из валюты регламентированного учета в валюту документа.
		ПересчитатьИзВалютыРегл(СтрРасшифровки.СуммаНУ, СтруктураДанных);
		ПересчитатьИзВалютыРегл(СтрРасшифровки.СуммаПР, СтруктураДанных);
				
		
		///////////////////////////////////////////////////////////////////////////
		// Вычислим значения: СуммаВР, СуммаОНА, СуммаОНО.
		
		бит_му_ОбщегоНазначения.РасчитатьСуммыОтложенныхНалоговыхАктивовОбязательств(СтрРасшифровки, СтавкаНалогаНаПрибыль)						
		
	КонецЦикла;
 	
КонецПроцедуры // ЗаполнитьТаблицуРасшифровки()

// Процедура проверяет данные.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  СтруктураТаблиц  		- Структура.
// 	Отказ     				- Булево.
//  Заголовок 				- Строка.
// 
Процедура ПроверкаДанных(СтруктураШапкиДокумента, СтруктураТаблиц, Отказ, Заголовок)

	// Проверка на заполненность счета расходов/доходов.
	Если Не ЗначениеЗаполнено(СчетРасходовДоходов) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("СчетРасходовДоходов", ПланыСчетов.бит_Дополнительный_2.ПустаяСсылка());
		Запрос.Текст = "
		|ВЫБРАТЬ
        |	РасчетыОН.НомерСтроки,
        |	РасчетыОН.ВидАктивовОбязательств,
        |	РасчетыОН.СчетРасходовДоходов
        |ИЗ
        |	Документ.бит_му_РасчетОтложенныхНалогов.РасчетыОН КАК РасчетыОН
        |ГДЕ
        |	РасчетыОН.Ссылка = &Ссылка
        |	И РасчетыОН.СчетРасходовДоходов = &СчетРасходовДоходов
		|";
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл			
				ТекстСообщения = НСтр("ru='В строке №%1 не указан счет расходов/доходов для вида активов/обязательств %2.';
				                      |en='In line №%1 expenditure / income account is not specified for the type of assets / liabilities %2.'");
		    	ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.НомерСтроки, Выборка.ВидАктивовОбязательств);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);				
			КонецЦикла;
			
			ТекстСообщения = НСтр("ru='Укажите счета расходов/доходов для названных строк или заполните значение счета по умолчанию на вкладке ""Счет расходов/доходов"".';
			                      |en='Specify expenditure/income accounts for mentioned lines or fill in the account value by default on the tab ""Expenditure/income account"".'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			
		КонецЕсли; 
 	
	КонецЕсли; 
	
КонецПроцедуры // ПроверкаДанных()

// Функция формирует таблицу отбора.
// 
// Параметры:
// СтруктураДанных - Структура.
// 
// Возвращаемое значение:
//  Таблица значений (Использование, Имя, ВидСравнения, Значение).
// 
Функция ДанныеДляОтбора()

	ТаблицаОтбора = Новый ТаблицаЗначений;
	ТаблицаОтбора.Колонки.Добавить("Использование");
	ТаблицаОтбора.Колонки.Добавить("Имя");
	ТаблицаОтбора.Колонки.Добавить("ВидСравнения");
	ТаблицаОтбора.Колонки.Добавить("Значение");
	// Организация.
	СтрокаОтбора = ТаблицаОтбора.Добавить();
	СтрокаОтбора.Использование = Истина;
	СтрокаОтбора.Имя 		   = "Организация";
	СтрокаОтбора.ВидСравнения  = ВидСравнения.Равно;
	СтрокаОтбора.Значение 	   = Организация;

	Возврат ТаблицаОтбора;
	
КонецФункции

// Процедура пересчитывает сумму из валюты регл учета в валюту.
// 
// Параметры:
//  Сумма  	  	    - Число.
//  СтруктураДанных - Структура.
// 
Процедура ПересчитатьИзВалютыРегл(Сумма, СтруктураДанных)

	Сумма = бит_КурсыВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(Сумма
													  ,СтруктураДанных.ВалютаРеглУчета
													  ,СтруктураДанных.Валюта
													  ,1
													  ,СтруктураДанных.Курс
													  ,1
													  ,СтруктураДанных.Кратность);
	
КонецПроцедуры // ПересчитатьИзВалютыРегл()
												  
// Процедура выполняет первоначальное заполнение созданного/скопированного документа.
// 
// Параметры:
//  ПараметрОбъектКопирования - ДокументОбъект.
// 
Процедура ПервоначальноеЗаполнениеДокумента(ПараметрОбъектКопирования = Неопределено)
	
	РучнаяКорректировка = Ложь;
	
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь(), ПараметрОбъектКопирования);	
												
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(ДатаСторно) Тогда
		ДатаСторно = НачалоМесяца(ДобавитьМесяц(Дата, 1));
	КонецЕсли; 

	// Документ не скопирован.
	Если ПараметрОбъектКопирования = Неопределено Тогда
		
		Если Не ЗначениеЗаполнено(ВалютаДокумента) Тогда
			
			// Заполним валюту документа валютой международного учета.
			ВалютаДокумента = бит_му_ОбщегоНазначения.ПолучитьВалютуМеждународногоУчета(Организация,, Ложь);
			
		КонецЕсли; 
		
	Иначе
		
		РасчетыОН.Очистить();
		
	КонецЕсли;
	
	ИзменениеВалютыМодуль();
    
	// Ставка налога на прибыль.
	Если (ПараметрОбъектКопирования = Неопределено И НЕ ЗначениеЗаполнено(СтавкаНалогаНаПрибыль)) 
	 ИЛИ НЕ ПараметрОбъектКопирования = Неопределено Тогда
		СтавкаНалогаНаПрибыль = бит_му_ОбщегоНазначения.ПолучитьСтавкуНалогаНаПрибыль(Дата, Организация);
	КонецЕсли; 
	
КонецПроцедуры // ПервоначальноеЗаполнениеДокумента()

Процедура ЗаполнитьШапкуПоСтруктуре(ДанныеЗаполнения)

    Для каждого КлючЗначение Из ДанныеЗаполнения Цикл
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта(КлючЗначение.Ключ,Метаданные()) 
		   И НЕ ЗначениеЗаполнено(ЭтотОбъект[КлючЗначение.Ключ]) Тогда
			ЭтотОбъект[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры
 
#Область ПроцедурыИФункцииДляОбеспеченияПроведенияДокумента

// Функция подготавливает структуру данных.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  СтруктураКурсыВалют     - Структура.
//  
// Возвращаемое значение:
//   Структура.
// 
Функция ПодготовитьСтруктуруДанных(СтруктураШапкиДокумента, СтруктураКурсыВалют)

	СтруктураДанных = Новый Структура;
	
	СтруктураДанных.Вставить("Организация"			, СтруктураШапкиДокумента.Организация);
	СтруктураДанных.Вставить("Дата"		  			, СтруктураШапкиДокумента.Дата);
	
	СтруктураДанных.Вставить("ВалютаМСФО" 	 		, СтруктураКурсыВалют.МУ.Валюта);
	СтруктураДанных.Вставить("КурсМСФО"   	 		, СтруктураКурсыВалют.МУ.Курс);
	СтруктураДанных.Вставить("КратностьМСФО" 		, СтруктураКурсыВалют.МУ.Кратность);
	
	СтруктураДанных.Вставить("ВалютаРеглУчета" 	 	, СтруктураКурсыВалют.Регл.Валюта);
	
	СтруктураДанных.Вставить("Валюта" 	 			, СтруктураКурсыВалют.Документ.Валюта);
	СтруктураДанных.Вставить("Курс"   	 			, СтруктураКурсыВалют.Документ.Курс);
	СтруктураДанных.Вставить("Кратность" 			, СтруктураКурсыВалют.Документ.Кратность);

	Возврат СтруктураДанных;
	
КонецФункции // ПодготовитьСтруктуруДанных()

// Процедура формирует движение по взаиморасчетам Дт 207 Кт 208. ДЕМО.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  СтруктураКурсыВалют 	- Структура.
// 
Процедура СформироватьДвиженияМУ(СтруктураШапкиДокумента, СтрокаТаблицы, СтруктураКурсыВалют)

	// ДТ СчетУчетаОНА 	КТ СчетРасходовДоходов 	СуммаОНА.
	Если СтрокаТаблицы.СуммаОНА <> 0 Тогда
		
		// Заполнение атрибутов записи.
		Содержание = НСтр("ru = 'Отложенные налоговые активы'; en = 'Deferred tax assets'");
		ДанныеЗаполнения = Новый Структура; 
		ДанныеЗаполнения.Вставить("Организация", СтруктураШапкиДокумента.Организация);
		ДанныеЗаполнения.Вставить("Период", СтруктураШапкиДокумента.Дата);
		ДанныеЗаполнения.Вставить("Валюта", СтруктураШапкиДокумента.ВалютаДокумента);
		ДанныеЗаполнения.Вставить("СчетДт", СчетУчетаОНА);
		ДанныеЗаполнения.Вставить("СчетКт", СтрокаТаблицы.СчетРасходовДоходов);
		ДанныеЗаполнения.Вставить("Сумма", СтрокаТаблицы.СуммаОНА);
		ДанныеЗаполнения.Вставить("Содержание", Содержание);

		ДобавитьЗаписиМУ(СтрокаТаблицы, ДанныеЗаполнения, СтруктураКурсыВалют);
			
	КонецЕсли;
	
	// ДТ СчетРасходовДоходов КТ СчетУчетаОНО СуммаОНО.
	Если СтрокаТаблицы.СуммаОНО <> 0 Тогда
		
		// Заполнение атрибутов записи.
		Содержание = НСтр("ru = 'Отложенные налоговые обязательства'; en = 'Deferred tax liabilities'");
										 
		ДанныеЗаполнения = Новый Структура; 
		ДанныеЗаполнения.Вставить("Организация", СтруктураШапкиДокумента.Организация);
		ДанныеЗаполнения.Вставить("Период", СтруктураШапкиДокумента.Дата);
		ДанныеЗаполнения.Вставить("Валюта", СтруктураШапкиДокумента.ВалютаДокумента);
		ДанныеЗаполнения.Вставить("СчетДт", СтрокаТаблицы.СчетРасходовДоходов);
		ДанныеЗаполнения.Вставить("СчетКт", СчетУчетаОНО);
		ДанныеЗаполнения.Вставить("Сумма", СтрокаТаблицы.СуммаОНО);
		ДанныеЗаполнения.Вставить("Содержание", Содержание);

	    ДобавитьЗаписиМУ(СтрокаТаблицы, ДанныеЗаполнения, СтруктураКурсыВалют);
			
	КонецЕсли;
	
КонецПроцедуры // СформироватьДвиженияМУ()

// Процедура заполняет запись по регистру бухгалтерии бит_Дополнительный_2.
// 
// Параметры:
//  СтруктураПараметров  - Структура.
//  СтруктураКурсыВалют  - Структура.
// 
Процедура ДобавитьЗаписиМУ(СтрокаТаблицы, СтруктураПараметров, СтруктураКурсыВалют)

	// Запись.
	Запись = Движения.бит_Дополнительный_2.Добавить();	
	бит_му_ОбщегоНазначения.ЗаполнитьЗаписьРегистраМУ(Запись, СтруктураПараметров);	
    // Заполнение аналитик.	
	бит_му_ОбщегоНазначения.ЗаполнитьАналитикуДт_Кт(Запись, СтрокаТаблицы, "Субконто_", "Субконто_", мКоличествоСубконтоМУ);
  	// Выполним валютные пересчеты.
	бит_му_ОбщегоНазначения.ВыполнитьВалютныеПересчетыЗаписи(СтруктураПараметров, Запись, СтруктураКурсыВалют);
	
	// Изменение кода. Начало. 13.11.2013{{
	бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетДт, Запись.СубконтоДт, "ВидыАктивовОбязательств", СтрокаТаблицы.ВидАктивовОбязательств);  
	бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетКт, Запись.СубконтоКт, "ВидыАктивовОбязательств", СтрокаТаблицы.ВидАктивовОбязательств);
	// Изменение кода. Конец. 13.11.2013}}
	
	// Запись сторно.
	ЗаписьСторно = Движения.бит_Дополнительный_2.Добавить();
	СтруктураПараметров.Вставить("Период", ДатаСторно);
	СтруктураПараметров.Вставить("Сумма", СтруктураПараметров.Сумма * -1);
	бит_му_ОбщегоНазначения.ЗаполнитьЗаписьРегистраМУ(ЗаписьСторно, СтруктураПараметров);
	// Заполнение аналитик.	
	бит_му_ОбщегоНазначения.ЗаполнитьАналитикуДт_Кт(ЗаписьСторно, СтрокаТаблицы, "Субконто_", "Субконто_", мКоличествоСубконтоМУ);
  	// Выполним валютные пересчеты.
	бит_му_ОбщегоНазначения.ВыполнитьВалютныеПересчетыЗаписи(СтруктураПараметров, ЗаписьСторно, СтруктураКурсыВалют);
	
	// Изменение кода. Начало. 13.11.2013{{
	бит_му_ОбщегоНазначения.УстановитьСубконто(ЗаписьСторно.СчетДт, ЗаписьСторно.СубконтоДт, "ВидыАктивовОбязательств", СтрокаТаблицы.ВидАктивовОбязательств);  
	бит_му_ОбщегоНазначения.УстановитьСубконто(ЗаписьСторно.СчетКт, ЗаписьСторно.СубконтоКт, "ВидыАктивовОбязательств", СтрокаТаблицы.ВидАктивовОбязательств);
	// Изменение кода. Конец. 13.11.2013}}
	
КонецПроцедуры // ДобавитьЗаписиМУ()

// Процедура выполняет движения по регистрам.
// 
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  СтруктураТаблиц 		- Структура.
//  СтруктураКурсыВалют 	- Структура.
//  Отказ 					- Булево.
//  Заголовок 				- Строка.
// 
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, СтруктураТаблиц, СтруктураКурсыВалют, Отказ, Заголовок)
	
	ТаблицаДанных = СтруктураТаблиц.РасчетыОН;
	
	СтруктураДанных = ПодготовитьСтруктуруДанных(СтруктураШапкиДокумента, СтруктураКурсыВалют);
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
			
		// Формируем проводку по отложенным активам и обязательствам.
		// ДТ СчетУчетаОНА 		  КТ СчетРасходовДоходов 	СуммаОНА.
		// ДТ СчетРасходовДоходов КТ СчетУчетаОНО 			СуммаОНО.
		СформироватьДвиженияМУ(СтруктураШапкиДокумента, СтрокаТаблицы, СтруктураКурсыВалют);
	
	КонецЦикла;	
		
КонецПроцедуры // ДвиженияПоРегистрам()

#КонецОбласти

#КонецОбласти

#Область Инициализация

мКоличествоСубконтоМУ = 4;

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
